Repository: zuhaibimtiaz/KycFlowApp
Catalog: KycFlow/Resources/Localizable.xcstrings
Source language: en
Languages: de

source: Complete Your KYC
de: Vervollständigen Sie Ihren Kuchen

source: Country of Residence
de: Land des Wohnsitzes

source: Country Selection
de: Länderauswahl

source: Full Screen
de: Vollbild

source: Half Sheet
de: Halbes Blatt

source: Kyc Form View
de: Ansicht des Kyc-Formulars

source: Next
de: Nächster

source: OK
de: OKAY

source: Please choose the country where you reside
de: Bitte wählen Sie das Land aus, in dem Sie wohnen

source: Please fill in all required fields
de: Bitte füllen Sie alle erforderlichen Felder aus

source: Please verify all information is correct before submitting.
de: Bitte überprüfen Sie, ob alle Informationen korrekt sind, bevor Sie sie einreichen.

source: Required
de: Erforderlich

source: Review your submitted information
de: Überprüfen Sie Ihre übermittelten Informationen

source: Select Country
de: Land auswählen

source: Select Your Country
de: Wähle dein Land

source: Submit
de: Senden

source: Summary Review
de: Zusammenfassende Überprüfung

source: This field is required
de: Dieses Feld ist erforderlich
